class Cards:
    """
    Card values
    """
    mast = {
        "Буба": 'Буба',
        "Чирва": 'Чирва',
        "Кресте": 'Кресте',
        "Пика": 'Пика',
    }

    colour = {
        "Желтый": 'Желтая',
        "Красный": 'Красная',
        "Синий": 'Синяя',
        "Зеленый": 'Зеленая',
    }

    znach = {
        "Смена направления": 'Смена_направления',
        "+2": 'Плюс_Две',
        "Пропуск хода": 'Пропуск_хода',
        "Ноль": '0',
        "Один": '1',
        "Два": '2',
        "Три": '3',
        "Четыре": '4',
        "Пять": '5',
        "Шесть": '6',
        "Семь": '7',
        "Восемь": '8',
        "Девять": '9',
        "Десять": '10',
        "Валет": 'Валет',
        "Дама": 'Дама',
        "Король": 'Король',
        "Туз": 'Туз',
    }

    black_aktiv_cards = {
        "Смена цвета": 'Смена_цвета',
        "Смена цвета + 4": 'Смена цвета_+_4',
    }
